{"code": "CS 495BW", "title": "Honors", "credits": "1-8", "typically_offered": "Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "CS_OX 297RE", "title": "Directed Study", "credits": "1-4", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "DANC_OX 300RE", "title": "Dance Company", "credits": "1", "typically_offered": "", "ger": "", "requirement_sentence": "Please contact the instructor to arrange an entrance interview to discuss training, experience, and expectations. (Permission of Instructor Required Prior to Enrollment)"}
{"code": "EAS 495BW", "title": "East Asian Studies Honors II", "credits": "4", "typically_offered": "Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "ECON 496RW", "title": "Tutorial in Economics", "credits": "4", "typically_offered": "Fall, Spring, and Summer", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "(ECON 201 or ECON_OX 201) and (ECON 212 or ECON_OX 212) or equivalent transfer credit as a prerequisite."}
{"code": "ECON 499RW", "title": "Undergraduate Research in Economics", "credits": "3-5", "typically_offered": "", "ger": "Experience and Application with Cont.Comm(*)", "requirement_sentence": "(ECON 201 or ECON_OX 201 or ECON 212 or ECON_OX 212) and (ECON 220 or ECON_OX 220 or MATH 361) or equivalent transfer credit as prerequisites."}
{"code": "ECON_OX 385RE", "title": "Special Topics In Economics", "credits": "1-4", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": "Econ 112_OX prerequisite (Permission Required Prior to Enrollment)"}
{"code": "ENG 311RW", "title": "Shakespeare", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "Selected major plays from the histories, comedies, tragedies, and romances. May be repeated for credit when topic varies. Satisfies Eng. Major Requirement(s): Pre-1700"}
{"code": "ENG 342RW", "title": "Modern Irish Literature", "credits": "4", "typically_offered": "", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "This course will explore the overlay of language and politics on an island where even what you call a place is it the North of Ireland or Northern Ireland? implies a political stance. You will learn how writers of fiction, plays, and poetry have not only imagined but contributed to cultural and political phenomena from the Irish Revival and the Easter Rising through the Troubles and the peace process. Focusing on Irish literature in English, you will also read some Irish-language literature in translation. Writers are likely to include, among others, Lady Gregory, W. B. Yeats, James Joyce, Seamus Heaney, Nuala Ní Dhomhnaill, and Anna Burns. Expect to read attentively, engage in class discussion, complete a brief in-class reading response or reading quiz each week, practice close reading in essay form, and develop a final project based in the splendid archives and manuscript collections of the Rose Library. Post 1900 Diverse Perspectives II"}
{"code": "ENG 383RW", "title": "Studies In Women's Fiction: Dystopias--Hers and His", "credits": "4", "typically_offered": "Spring", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "Dystopian novels have been so prominent in recent fiction that critics have described our time as a golden age for the genre. The result has been that, as one writer puts it, \"there's a book for every type of modern dread.\" Particularly notable in this current dystopic outpouring has been the influence of women writers. This course juxtaposes the most famous dystopia written in English, George Orwell's 1984, with novels by contemporary women writers (Ling Ma, Octavia Butler, Margaret Atwood, and one TBA) to explore how their works are reshaping the genre. The imaginative societies envisioned by these writers pose crucial questions about where the real dangers lie for our future and our present through their groundbreaking dystopic novels. Requirements are active & informed class participation; occasional response paragraphs; 2 short papers, one potentially optional. Post 1900 Diverse Perspectives II Prose"}
{"code": "BIOL_OX 399RE", "title": "Undergraduate Research", "credits": "1-4", "typically_offered": "", "ger": "", "requirement_sentence": "ORS (Permission of Instructor Required Prior to Enrollment)"}
{"code": "CHEM 202ZL", "title": "Principles of Reactivity Lab", "credits": "2", "typically_offered": "", "ger": "", "requirement_sentence": "CHEM 202Z as co-requisite. Students must enroll in CHEM 202Z first. This course is only for freshmen entering with AP, IB, or other Chem 150 transfer credit and who are taking CHEM 202Z."}
{"code": "CHEM 203ZL", "title": "Advanced Reactivity Lab", "credits": "2", "typically_offered": "", "ger": "", "requirement_sentence": "CHEM 202ZL as prerequisite and CHEM 203Z as co-requisite or equivalent transfer credit. This course is only intended for students who are taking Chem 203z concurrently. Please do not enroll if you are not."}
{"code": "CHEM 335LW", "title": "Quantum Chemistry Lab", "credits": "3", "typically_offered": "Fall", "ger": "Science, Nature, & Technology Lab with Writing", "requirement_sentence": "(CHEM 205 or CHEM_OX 205) and (CHEM 205L or CHEM_OX 205L) or equivalent transfer credit as prerequisite."}
{"code": "CHEM 371LW", "title": "Special Laboratory Topics in Chemistry: Chemistry of Color (LW)", "credits": "3", "typically_offered": "", "ger": "", "requirement_sentence": "CHEM 300L or equivalent transfer credit as prerequisite. Special Topic: Chemistry of Color (LW)"}
{"code": "CHEM 495BW", "title": "Honors Thesis", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "CHEM_OX 399RE", "title": "Independent Laboratory Research", "credits": "1-4", "typically_offered": "", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "CL 329RW", "title": "Spec Studies in Classical Culture: Tragic Heroines", "credits": "4", "typically_offered": "Fall, Spring, and Summer", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Same as ITAL 375W 1, CPLT 389W 1, and WGS 385W 2) (Complete Topic - Tragic Heroines: Writing Women Across the Centuries) (This seminar will examine the role that women have played in the process of writing tragedy and how they have come to be viewed as the bearers of tragic pathos from classical antiquity to the Renaissance. The classical tragic figure could be either male or female, but the Renaissance ushers in new gender roles and modes of viewing that significantly alter this paradigm. In this class, we will explore the causes and effects of female subjectivity, agency, and sexuality beginning with Sophocles Antigone in 441 BCE and until the publication of Valeria Maini's lesbian-centered heroine, Celinda, published in 1611 CE. We will also focus on numerous theoretical texts that deal with the aesthetics of tragedy, all authored by men, to see how tragedy became a vehicle to challenge and question prevailing civic structures through the gendered lens of writing the tragic, female experience. Texts to be read may include a selection: Sophocles - Antigone Euripides - Alcestis Euripedes - Medea Seneca -Thyestes Gian Giorgio Trissino - Sofonisba Giambattista Giraldi Cinzio - Orbecche Sperone Speroni - Canace Torquato Tasso - Aminta and Re Torrismondo Aristotle - Poetics Horace - Ars Poetica Salvatore Di Maria - The Italian Tragedy in the Renaissance Freud - The Interpretation of Dreams and Beyond the Pleasure Principle Lacan - Seminar VII: The Ethics of Psychoanalysis)"}
{"code": "CL 495BW", "title": "Honors Course", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "CPLT 495BW", "title": "Honors Thesis", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "ENG 384RW", "title": "Criticism: Read, Think, Write!", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Topic:Read, Think, Write! Intro. to Literary Theory and Criticism) (In read, think, write we will study the various ways in which scholars of literature instruct their readers on how to interpret literature, argue about its value, and the role it plays in society. Learning about each of the theoretical frameworks will allow you to not only learn about the ways scholars have tried to interpret texts, but also to critically read literature using the methods they have developed. We will address questions such as: how to read a literary text from a Feminist, Queer, Marxist or post-colonial perspective? We will learn about how these schools of thought emerged, some of the most prominent theorists, and the central questions they ask when critically analyzing a text. Student will choose literary pieces to perform different styles of critical interpretations from different literary theories. The goal is to provide you with a foundation for understanding how literature is discussed in scholarly and critical discourse.) Required Texts: -Vincent Leitch, et.al. The Norton Anthology of Theory and Criticism -Wesley Brown and Amy Ling, Imagining America."}
{"code": "ENG 480RW", "title": "Seminar in Poetry:English: Contemporary American Poetry", "credits": "4", "typically_offered": "Fall", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "This seminar will survey major poets, schools and movements that make up the canon of Contemporary American Poetry in conversation with emerging voices from the present. Special attention will be devoted to the Black Aesthetic, the Beat generation, feminist poetics, and recent verse of LGBTQIA+ and new social movements. In addition, the course will afford students opportunities to pursue archival research working with manuscripts, correspondence, scrapbooks, rare editions, broadsides, and little magazines housed in Emory's Stuart A. Rose Manuscripts, Archives, and Rare Book Library."}
{"code": "ENG 482RW", "title": "Seminar in Fiction:English: Virginia Woolf & Her Contemp.", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "In her essay \"How Should One Read a Book?\" Virginia Woolf suggests that the best way to experience fiction is to drop all preconceived notions of what a novel can be: \"do not dictate to your author; try to become him. Be his fellow-worker and his accomplice.\" In this course we will become the accomplices of one of the most inventive writers of twentieth-century literature. Reading our way through some of Woolf's major novels as well as selected essays, stories, and autobiographical writing, we will think about Woolf as a critic, humorist, feminist, and literary innovator, with special consideration to the way Woolf reinvents representations of character and human consciousness. While we focus on Woolf's illuminations of the interior self, we will also explore the adventurous artistic and philosophical spirit of Bloomsbury and how her work reflects England's transformation in the first half of the twentieth century: world war and its aftermath, changing social and sexual mores, new conceptions of gender roles and women's rights, advances in human psychology, and contemporaneous developments in painting and design. Texts may include some of the following: Woolf, Night and Day, Mrs. Dalloway, To the Lighthouse, Orlando, Between the Acts; The Waves; A Room of One's Own; Forster, Maurice; Bowen, The House in Paris; Mansfield, stories; Watson, Miss Pettigrew Lives for a Day. Expectations: lively participation; weekly short Canvas postings; midterm and final essays."}
{"code": "ENG 483RW", "title": "Seminar in Criticism & Theory: Comparative Lit. Major Seminar", "credits": "4", "typically_offered": "Spring", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Same as CPLT 490W 1) \"How we Read, or the Scales of World Literature\" This course is interested in reading practices and paradigms (such as close, distant, thematic, comparative, relational, contrapuntal, connective, transnational) that underpin world literature. And it addresses various conceptualizations of scale and scaling as a way of exploring the myriad relations and connections established between texts and communities in world literature. Scales that run from granular, local, minor, or regional frameworks to macro analyses like world-systems, connected histories, deep time, planetarity, and/or the digital humanities. As we engage with the question of scale, we'll take up important discussions in the field, like how well literature travels and on what basis, the many modes of text and textuality, the ethical implications of close versus distant reading practices, the risks of comparison, the significance of interpretative communities, the dialectic between literature and history, the problem of linguistic difference, and what is lost or gained in translation. Some of our primary readings, subject to change, include J.M. Coetzee, Diary of A Bad Year, Sabahattin Ali's Madonna in a Fur Coat, Hamid Ismailov's Gaia, Queen of Ants, and Amitav Ghosh's In An Antique Land."}
{"code": "ENG 495BW", "title": "Honors Thesis", "credits": "1-8", "typically_offered": "Fall, Spring, and Summer", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "ENGCW 370RW", "title": "Creative Writing: Intermediate Fiction", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Permission Required Prior to Enrollment) Application required. If accepted, YOU MUST ATTEND THE FIRST CLASS session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions. Inventing Time in Short Fiction This course expands craft concepts introduced in introductory creative writing coursework with a special focus on the narrative possibilities of time. How might we maintain a short story's necessary \"intensity of focus\" within a timeframe that spans centuries? How might a short story that takes place over the course of an hour give every detail heightened significance? In addition to exploring the narrative pressures of different timeframes, we will look at stories that break linearity, gesturing toward the future and even using elements like time travel to negotiate the constraints of the short story form. Selections from contemporary short fiction authors like Venita Blackburn, Sean Vestal, Mariah Rigg, Jonathan Escoffery, Brenda Peynado, Steven Millhauser, Ted Chiang, and Sofia Samatar will be included in our studies."}
{"code": "ENGCW 371RW", "title": "Creative Writing: Intermediate Poetry", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Permission Required Prior to Enrollment) Application required. If accepted, YOU MUST ATTEND THE FIRST CLASS session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions. FORMS In this intermediate course, you will find a community of poets serious about their craft, hoping to deepen their engagement with the art of poetry. Through the shared sense of trust and endeavor provided by the workshop community, we will closely read the work of published poets and that of our peers as we draft new poems ourselves. To structure our in-class discussions and the weekly creation of new work, we will look closely at prosody and the resurgence of traditional forms in the work of contemporary American poets. As we try out various forms ourselves, we will situate our own poetic experiments in a centuries-long conversation extending to our present moment."}
{"code": "ENGCW 372RW", "title": "Intermediate Playwriting", "credits": "4", "typically_offered": "Fall", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Same as THEA 372RW 1) (Permission Required Prior to Enrollment) Application required. If accepted, you must attend the first class session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions. The instructor will be incoming Playwriting Fellow, PHANESIA PHAREL: https://creativewriting.emory.edu/people/bios/pharel-phan%C3%A9sia.html Application required. If accepted, you must attend the first class session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Plays are a human truth told in time. That truth is then brought to an audience to react, decide, reflect, and revolt. Plays are a singular democratic practice and gift in the human experience. Every single one of us has brilliant plays inside us, stories that connect others and help people feel alive, but how do we tell them? How do you figure out and access your truth - but more importantly, how can you make your truth legible to the outside world? In Intermediate Playwriting, we will be learning various elements of the craft, voyaging over a century worth of American playwrights to learn different tools and techniques, but more importantly for you to access what excites you and what themes you'd like your work to be in conversation with. In breaking down literary texts and exploring theatrical history, I often pose the central questions: What makes a play a play? What is theatricality? By investigating the foundations of story and identifying the elements that make a text theatrical, students develop a deeper understanding of both the craft and the medium. We will do this over a series of multiple exercises, and you will write a one-act play."}
{"code": "ENGCW 376RW", "title": "Creative Writing: Intermediate Non-Fiction", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Permission Required Prior to Enrollment) Application required. If accepted, YOU MUST ATTEND THE FIRST CLASS session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions. Nonfiction Magazine and Long-form Writing. No pre-requisite. This class is NOT open to first-year students. This workshop is focused on long-form, nonfiction magazine and feature writing -- reading it, reporting it, writing it, and doing so in ways and by means that separate the exceptional from the pedestrian. This is nonfiction. Be prepared to be a reporter, to meet people face-to-face, to ask questions, to see and hear things with your own eyes and ears. My goal is to get your work published. We'll have visiting experts on hand as we discuss where great ideas come from, how to be strategic in your reporting, the art of the interview, and crafting stories, then stories within stories. We're looking mostly at print, but we will see beyond the dead tree media at the growing opportunities for magazine-style writing and long-form narratives online. Ultimately, the goal of the course is for you to become a considerably wiser and more effective nonfiction storyteller, for which the basis is sound reporting. Students should budget to purchase the textbook and for photocopying."}
{"code": "ENGCW 378RW", "title": "Screenwriting", "credits": "4", "typically_offered": "Fall, Spring, and Summer", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "ENGCW 270/270W or ENGCW_OX 270 or ENGCW 271/271W or ENGCW_OX 271 or ENGCW 272/272W or FILM 101 or FILM_OX 101 or equivalent transfer credit as prerequisite. (Same as FILM 378RW 2) (Permission Required Prior to Enrollment) Application required. YOU MUST ATTEND THE SECOND CLASS session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions. WRITING THE SHORT FILM. Instructor will be incoming Screenwriting Fellow, Carolyn Kras. This course introduces students to dramatic writing for short motion pictures. The topics covered include visual writing, plot, story structure, character, and dialogue. Emphasis is placed on telling a story in cinematic terms. In addition to completing several writing assignments, students are expected to develop, pitch, outline, and write a short screenplay."}
{"code": "ENG_OX 389RW", "title": "Special Topics In Literature: Medical/Environ. Humanities", "credits": "4", "typically_offered": "Irregularly", "ger": "Continuing Comm.& Writing with Race & Ethnicity(*)", "requirement_sentence": "Topic: Contagion and Crisis: Medical and Environmental Humanities This course surveys three centuries of epidemic literature, from the 1854 cholera outbreaks through contemporary pandemic narratives. Students will examine how literary and non-literary representations of contagion illuminate patterns of social inequality, environmental degradation, and systemic vulnerability. The course traces the evolution of disease narratives from the nineteenth-century urban crises to contemporary explorations of pandemic capitalism and bio-engineered plagues. Through critical analysis of texts spanning multiple historical periods, students will develop advanced skills in literary interpretation while engaging with urgent questions about environmental racism, global health disparities, and speculative futures in an era of interconnected crises."}
{"code": "ENG_OX 399RE", "title": "Independent Study", "credits": "1-4", "typically_offered": "", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "ENVS 247LW", "title": "Ecology Laboratory", "credits": "3", "typically_offered": "", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "This course requires BIOL 142, BIOL 142L or BIOL_OX142 AND BIOL/ENVS 247 or equivalent transfer credit as a prerequisite. (Same as BIOL 247LW 1) (This is the optional laboratory portion of the Ecology class. Field studies will be conducted in various natural areas in Georgia, including a weekend trip to the mountains. Pre- or corequisite: Biology 247/ENVS 247. This course fulfills elective and upper-level laboratory credit for the biology major and the Writing requirement for the GERs.)"}
{"code": "ENVS 494RW", "title": "Individual Research in ENVS", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Experience and Application with Cont.Comm(*)", "requirement_sentence": ""}
{"code": "ENVS 495BW", "title": "Honors Research", "credits": "4", "typically_offered": "Fall, Spring, and Summer", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "ENVS 498RW", "title": "Individual Directed Reading", "credits": "1-8", "typically_offered": "Fall, Spring, and Summer", "ger": "", "requirement_sentence": ""}
{"code": "ENVS 499RW", "title": "Advanced Independent Research", "credits": "1-12", "typically_offered": "Fall, Spring, and Summer", "ger": "Experience and Application with Cont.Comm(*)", "requirement_sentence": ""}
{"code": "ENVS_OX 299RE", "title": "Undergraduate Research", "credits": "1-4", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "FILM 378RW", "title": "Screenwriting", "credits": "4", "typically_offered": "", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "ENGCW 270/270W or ENGCW_OX 270 or ENGCW 271/271W or ENGCW_OX 271 or ENGCW 272/272W or FILM 101 or FILM_OX 101 or equivalent transfer credit as prerequisite. (Same as ENGCW 378RW 3)"}
{"code": "FILM 379RW", "title": "Advanced Screenwriting", "credits": "4", "typically_offered": "", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "FILM 378R or ENGCW 378R or FILM 378RW or ENGCW 378RW or FILM_OX 378RW or ENG_OX 378RW or equivalent transfer credit as prerequisite. (Same as ENGCW 379RW 1)"}
{"code": "AAS 387RW", "title": "GA Civil Rights Cold Cases", "credits": "4", "typically_offered": "Fall and Spring", "ger": "History, Society, Cultures with Writing", "requirement_sentence": "(Same as ENGCW 385RW 1, AMST 387RW 1, HIST 387RW 1) (Permission Required Prior to Enrollment) Application required. If accepted, you must attend the first class session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions."}
{"code": "AAS 495BW", "title": "Honors Thesis", "credits": "3", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "AFS 495BW", "title": "African Studies Honors", "credits": "4", "typically_offered": "Spring", "ger": "", "requirement_sentence": ""}
{"code": "AMST 387RW", "title": "GA Civil Rights Cold Cases", "credits": "4", "typically_offered": "Fall and Spring", "ger": "History, Society, Cultures with Writing", "requirement_sentence": "(Same as ENGCW 385RW 1, AAS 387RW 1, HIST 387RW 1) (Permission Required Prior to Enrollment) Application required. If accepted, you must attend the first class session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions."}
{"code": "AMST 495BW", "title": "Honors Thesis", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "ANT 495BW", "title": "Honors Research II", "credits": "1-4", "typically_offered": "Spring", "ger": "Experience and Application with Cont.Comm(*)", "requirement_sentence": "Departmental invitation to Honors Program necessary before registration."}
{"code": "BIOL 247LW", "title": "Ecology Laboratory", "credits": "3", "typically_offered": "Fall", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "This course requires BIOL 142, BIOL 142L or BIOL_OX142 AND BIOL/ENVS 247 or equivalent transfer credit as a prerequisite. (Same as ENVS 247LW 1) (This is the optional laboratory portion of the Ecology class. Field studies will be conducted in various natural areas in Georgia, including a weekend trip to the mountains. Pre- or corequisite: Biology 247/ENVS 247. This course fulfills elective and upper-level laboratory credit for the biology major and the Writing requirement for the GERs.)"}
{"code": "BIOL 495BW", "title": "Honors Research", "credits": "1-4", "typically_offered": "Fall, Spring, and Summer", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "This course requires BIOL 142 and BIOL 142L or BIOL_OX142 or BIOL 152 AND BIOL 495A or equivalent transfer credit as a prerequisite. This is the second semester of the Biology Honors Program, for Senior Biology majors in their last semester at Emory. Permission of instructor is required. Contact Tonya Woolcock at tdavis6@emory.edu to request a permission number for Biology 495BW and add the course to your schedule before the add/drop/swap period ends for the semester. This course will fulfill elective and upper-level lab requirements for the Biology major and a writing requirement for the GERs. See the COURSE ATLAS for additional information."}
{"code": "BIOL_OX 142WE", "title": "Foundations of Modern Biology II with Laboratory", "credits": "5", "typically_offered": "Fall and Spring", "ger": "Natural Sciences with Continuing Communication(*)", "requirement_sentence": "(BIOL 141 and BIOL 141L) or (BIOL_OX 141 and BIOL_OX 141L) or equivalent transfer credit as prerequisite. Students with AP/IB credit for BIOL 141/BIOL_OX 141 will have to take BIOL 141L or BIOL_OX 141L. Must also enroll in W 10:00AM lab section"}
{"code": "FILM 495BW", "title": "Honors Thesis", "credits": "1-4", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "FREN 495BW", "title": "Honors Seminar in French", "credits": "1-8", "typically_offered": "Spring", "ger": "", "requirement_sentence": "FREN 310, FREN 314 and two 300 level FREN courses, or equivalent transfer credit as prerequisite."}
{"code": "GRK 495BW", "title": "Honors", "credits": "4", "typically_offered": "Fall", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "HIST 387RW", "title": "GA Civil Rights Cold Cases", "credits": "4", "typically_offered": "Fall and Spring", "ger": "History, Society, Cultures with Writing", "requirement_sentence": "(Same ENGCW 385RW 1, AAS 387RW 1, AMST 387RW 1) (Permission Required Prior to Enrollment) Application required. If accepted, you must attend the first class session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions."}
{"code": "HIST 398RW", "title": "Research Tutorial", "credits": "1-4", "typically_offered": "", "ger": "Experience and Application with Cont.Comm(*)", "requirement_sentence": "(Permission Required Prior to Enrollment)"}
{"code": "HIST 487RW", "title": "Jr/Sr Colloquium: Europe: Medieval Lives", "credits": "4", "typically_offered": "Fall, Spring, and Summer", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "Complete topic: Medieval Lives: Love, Loss, Vengeance & Hatred This course is a social history of the Middle Ages. It takes a thematic approach by focusing on the lives of the elite, city dwellers, the peasantry, and religious minorities (Jews and Muslims). Topics covered include miracles and saints, knightly training, travelers and merchant capitalists, university life, marriage, sex workers, medicine and the Black Death, gender identities, fashion and material culture."}
{"code": "HIST 488RW", "title": "Jr./Sr. Colloquium: U.S.: Jewish Immigration1880-1924:East Europe to America", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "(Same as JS 490RW 1)"}
{"code": "HIST 489RW", "title": "Jr/Sr Coll: LatAm&NonWest Wrld: Partition of India, 1947", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "This course deals with the memory/history of the Partition of British India in 1947. This Partition resulted in the establishment of the nation-states of India, Pakistan and (in time) Bangladesh. The course investigates official and unofficial histories of this critical moment, when more than a million people died and over ten million became refugees in the subcontinent, and juxtaposes them with the memories of people who lived through the times. It lays emphasis on close reading and discussion to develop a critical approach to the understanding of modern societies and contested versions of history. We examine views of the past and the present that emerge in the new nation-states through a variety of primary and secondary sources, focusing on (1) official and academic histories, media, fiction and films; (2) oral accounts reflecting the new identities and perspectives of local groups, communities and regions, divided as these are by gender, caste and class."}
{"code": "HIST 495BW", "title": "Intro Historical Interpretation II", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "(Permission Required Prior to Enrollment) For Graduating History Honors Students Only."}
{"code": "HIST_OX 101WE", "title": "The Renaissance and Beyond", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Social Sciences with Continuing Communication(*)", "requirement_sentence": "Students are required to participate in 3 field trips to locations in Newton County that provide \"essential services\". Each field trip will be approximately 2-3 hours and will take place outside of class time. Transportation will be provided."}
{"code": "ENGCW 379RW", "title": "Advanced Screenwriting", "credits": "4", "typically_offered": "", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Same as FILM 379RW 1)"}
{"code": "ENGCW 385RW", "title": "GA Civil Rights Cold Cases", "credits": "4", "typically_offered": "Fall and Spring", "ger": "History, Society, Cultures with Writing", "requirement_sentence": "(Same as AAS 387RW 1, AMST 387RW 1, HIST 387RW 1) (Permission Required Prior to Enrollment) Application required. If accepted, you must attend the first class session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions. In the years between 1945 and 1968, untold numbers of American citizens were targeted for death because of their race, beliefs, or civil rights work - and in some cases merely because of what they drove, how they spoke, or the ever-shifting lines of racial etiquette they crossed. In many cases, their murders were inadequately investigated or prosecuted, their stories left untold, and the crimes against their humanity never punished. The Georgia Civil Rights Cold Cases Project at Emory University is both a class and an ongoing historical and journalistic exploration of the Jim Crow South through the prism of unsolved or unpunished civil rights-era murders in Georgia. Using primary evidence including FBI records, NAACP files, old newspaper clippings, court transcripts, and personal archives students come to see and understand history from the inside out. Student essays, grounded in secondary readings that provide broader context, will be aimed at the project website, coldcases.emory.edu. Students also may become engaged in helping research a new season of the podcast, Buried Truths, based on a case we'll be examining in class. Students should budget for photocopying."}
{"code": "ENGCW 397RW", "title": "Creative Writing: Independent Study", "credits": "1-8", "typically_offered": "Fall, Spring, and Summer", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "(Permission Required Prior to Enrollment)"}
{"code": "ENGCW 495BW", "title": "Creative Writing Honors", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "(Permission Required Prior to Enrollment)"}
{"code": "ENGRD 221RW", "title": "Advanced Writing Workshop", "credits": "4", "typically_offered": "Fall, Spring, and Summer", "ger": "Humanities and Arts with Cont.Communication(*)", "requirement_sentence": "This is an English Language Learner (ELL) course. Contact Jane O'Connor (jcoconn@emory.edu) for permission to enroll. Language, Land, & Place This course offers an introduction to various nonfiction genres (including flash nonfiction, photo-essay, and personal essay) and approaches to writing that destabilize standard academic English (including Indigenous language reclamation, multilingualism, and translingualism). We will read and discuss a range of scholarship in Black, Indigenous, Asian/American, and Latinx/Latine rhetoric, writing, and literacy; ground ourselves in our shared contexts of Atlanta and the larger Southeast; and develop shared practices of land- and place-based writing."}
{"code": "ENGRD 411RW", "title": "History & Theory in Rhetoric/Writing/Literacy", "credits": "4", "typically_offered": "", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "Cultural Rhetorics is a growing subfield of Rhetoric, Writing, and Literacy studies that poses a critical challenge to the discipline's foundations in Greek and Roman oratorical traditions. In this course, we will engage with a range of scholarly and creative work in Black, Asian, Indigenous, Latinx/Latine, Queer, and Disability studies, and engage with \"rhetoric\" as a set of practices tied to multiple understandings of \"culture\" and \"community.\" This is a LINC course that will be co-taught with a Georgia State University class focused on Africana Methods, and students will meet for concurrent Zoom and in-person sessions over the course of the semester."}
{"code": "ENG_OX 212RW", "title": "Readings In Pop Literature and Culture: The Harry Potter Phenomenon", "credits": "4", "typically_offered": "Irregularly", "ger": "Humanities and Arts with Cont.Communication(*)", "requirement_sentence": ""}
{"code": "ENG_OX 221RW", "title": "Advanced Writing Workshop: Writing in the Health Sciences", "credits": "4", "typically_offered": "", "ger": "Humanities and Arts with Cont.Communication(*)", "requirement_sentence": "Rqmt Dsgn: Humanities and Arts with Writing"}
{"code": "ENG_OX 359RW", "title": "Studies in African American Literature 1900-Present: Afr.Amer.Genre Fic:SciFi,Crime", "credits": "4", "typically_offered": "Fall", "ger": "Continuing Comm.& Writing with Race & Ethnicity(*)", "requirement_sentence": ""}
{"code": "ENG_OX 381RW", "title": "Topics In Women's Literature: The Bronte Sisters", "credits": "4", "typically_offered": "Irregularly", "ger": "", "requirement_sentence": ""}
{"code": "SOC 495BW", "title": "Honors", "credits": "1-8", "typically_offered": "Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "SOC_OX 397RE", "title": "Directed Study", "credits": "1-3", "typically_offered": "", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "SPAN 495BW", "title": "Honors", "credits": "4", "typically_offered": "Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "THEA 372RW", "title": "Intermediate Playwriting", "credits": "4", "typically_offered": "Fall", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Same as ENGCW 372RW 1) (Permission Required Prior to Enrollment) Application required. If accepted, you must attend the first class session to remain enrolled. Class description and application form are available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/applications.html Please email nora.lewis@emory.edu if you have any questions."}
{"code": "THEA 495BW", "title": "Honors Project in Theater", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": ""}
{"code": "THEA_OX 200RE", "title": "Theatre Practicum", "credits": "1-4", "typically_offered": "", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "WGS 490RW", "title": "Senior Sem in Women, Gender, & Sexuality Studies", "credits": "4", "typically_offered": "Fall", "ger": "History, Society, Cultures with Writing", "requirement_sentence": ""}
{"code": "WGS 495BW", "title": "Honors Research", "credits": "1-8", "typically_offered": "Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "(Permission Required Prior to Enrollment)"}
{"code": "WGS_OX 385RE", "title": "Special Topics in Women's, Gender and Sexuality Studies: Feminist/Queer Art & Politics", "credits": "3", "typically_offered": "", "ger": "", "requirement_sentence": "Feminist Art and Politics will draw upon a range of creative sites through which social and political life in the United States has been explored, challenged and re-imagined. In this discussion-based seminar, we will examine our own political and ethical commitments and try to open up space for thinking differently about ourselves and our place in the world. Our syllabus will include film, fiction, poetry, and music, alongside more \"traditional\" queer and feminist theory. These diverse texts will allow us to engage intersectional feminist thought through an interdisciplinary lens, analyzing concepts of world-building, dis/ability, liberation, justice, anti-racism, and queerness. No prerequisites are required."}
{"code": "NBB_OX 499RE", "title": "Mentored Research in NBB", "credits": "4", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": ""}
{"code": "", "title": "", "credits": "", "typically_offered": "", "ger": "", "requirement_sentence": "Two PHIL courses or equivalent transfer credit as prerequisite."}
{"code": "PHIL 495BW", "title": "Honors (Directed Reading)", "credits": "1-4", "typically_offered": "Fall, Spring, and Summer", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "Two PHIL courses or equivalent transfer credit as prerequisite."}
{"code": "PHYS 495BW", "title": "Honors Research", "credits": "1-8", "typically_offered": "Fall, Spring, and Summer", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "POLS 495BW", "title": "Research: Honors Tutorial", "credits": "1-8", "typically_offered": "Fall", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "POLS 496RW", "title": "Internship in Political Science", "credits": "4-12", "typically_offered": "Fall, Spring, and Summer", "ger": "Experience and Application with Cont.Comm(*)", "requirement_sentence": ""}
{"code": "POLS_OX 397RE", "title": "Directed Study", "credits": "1-4", "typically_offered": "", "ger": "", "requirement_sentence": "(Permission Required Prior to Enrollment)"}
{"code": "PORT 495BW", "title": "Honors Thesis", "credits": "4", "typically_offered": "", "ger": "", "requirement_sentence": ""}
{"code": "PSYC 495BW", "title": "Honors Program", "credits": "1-8", "typically_offered": "Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "Pre-requisite: PSYC 495A. Permission is required for enrollment."}
{"code": "HIST_OX 102WE", "title": "Nationalism and Nation-State Formation", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Social Sciences with Continuing Communication(*)", "requirement_sentence": ""}
{"code": "HLTH 495BW", "title": "Honors Research", "credits": "1-4", "typically_offered": "Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "HLTH 210 and HLTH 230 and HLTH 250 or equivalent transfer credit as a prerequisite."}
{"code": "IDS 220RW", "title": "ORDER Seminar: What Does it Mean to be Human?", "credits": "4", "typically_offered": "", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "Through an interdisciplinary exploration combining social sciences, sciences, and humanities disciplines and methodologies, we will engage in creative and intellectually rigorous conversation about the human experience, while writing our own stories in the process. This course will progress through separate topical units centered around three core questions: -How do we understand ourselves? Why is it difficult to define what is human? Why do we need to think of humanity as a problem? -Human compared to what? Here we seek to further illustrate what makes humanity distinct through a comparative lens. What is a human compared to an animal, a robot, or even, considering our strange relationship to the nation-state, a citizen? In doing this, we will think deeply about how humanity defines itself through and against its own narratives of power and dominance. -Where are we going? In addressing this question, we will attempt to work through some of the largest existential threats to humankind and determine two things: How do different disciplines tackle these issues? And can these disciplines work together to solve them?"}
{"code": "IDS 495BW", "title": "Honors", "credits": "4", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "INTER_OX 490RE", "title": "Introduction Liberal Arts Internship", "credits": "1", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "INTER_OX 492RE", "title": "Disciplinary Internship", "credits": "1", "typically_offered": "", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "JPN 495BW", "title": "Honors Japanese", "credits": "4", "typically_offered": "Spring", "ger": "", "requirement_sentence": ""}
{"code": "LAT 495BW", "title": "Honors", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "LING 495BW", "title": "Honors Directed Research", "credits": "1-8", "typically_offered": "Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "LING_OX 397RE", "title": "Directed Study in Linguisitics", "credits": "1-4", "typically_offered": "", "ger": "", "requirement_sentence": "(Permission Required Prior to Enrollment)"}
{"code": "PSYC_OX 397RE", "title": "Directed Study In Psychology", "credits": "1-4", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": "(Permission Required Prior to Enrollment)"}
{"code": "QTM 495BW", "title": "Honors Research", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": ""}
{"code": "QTM 496RW", "title": "Quantitative Sciences Internship", "credits": "1-12", "typically_offered": "Fall and Spring", "ger": "Experience and Application with Cont.Comm(*)", "requirement_sentence": "This is the course number for students receiving QTM credit hours for their quantitative intern experience. Securing an appropriate internship and completing the relevant application form prior to the deadline is the responsibility of the student. See this page for additional information: https://quantitative.emory.edu/opportunities/internships.html"}
{"code": "REES 495BW", "title": "Honors Program in REES", "credits": "4", "typically_offered": "", "ger": "", "requirement_sentence": ""}
{"code": "REL 354RW", "title": "Ethics: Buddhist Ethics", "credits": "4", "typically_offered": "Fall, Spring, and Summer", "ger": "Humanities, Arts, Performance with Writing", "requirement_sentence": "(Same as PHIL 385W 1) (This course satisfies the Religion major requirement: - Tradition-Buddhism, Theme.) (This writing-intensive seminar takes a broadly philosophical approach to the study of Buddhist understandings of the nature of goodness and how goodness can be recognized and cultivated. Materials for the course will range from Buddhist scriptures, to philosophical treatises, to narratives, to poetry, and to films. The intention of the course is to engage seriously with Buddhist understandings of the nature of the human condition as infused with suffering, and how humans can nevertheless develop goodness and resilience within this fleeting and unstable world. Topics include the extent and limits of generosity, the proper objects of loving-kindness and compassion, the moral consequences of truths and falsehoods, and mind-training techniques for taking obstacles as the path.) (Writing assignments will be weekly and will emphasize engagement with the course materials. There will be a final written project that builds on the work done during the semester.)"}
{"code": "REL 495BW", "title": "Directed Reading (Honors)", "credits": "4", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": ""}
{"code": "REL_OX 170RW", "title": "Special Topics in Religion: Howard Thurman & Community", "credits": "4", "typically_offered": "Irregularly", "ger": "Continuing Comm.& Writing with Race & Ethnicity(*)", "requirement_sentence": "No pre-requisite required. This course explores the contributions of the theologian, mystic, and often-overlooked Civil Rights hero Howard Thurman on how people can work to establish, build, and extend community. Thurman, who led the first African Americans to meet with Gandhi in India, was a mentor to many Civil Rights leaders, and his classic book, Jesus and the Disinherited, served as an inspiration to them. After an examination of Thurman's life and thought, the course will focus on his interpretations of Jesus's Prodigal Son and Good Samaritan parables, because they illustrate Thurman's understanding of how to (re)establish community. In brief, Thurman's mysticism, its relationship with social change, and his practice of using the fine arts to raise one's spiritual consciousness and foster community, encourage a \"sympathetic understanding\" of other human beings."}
{"code": "REL_OX 397RE", "title": "Directed Study", "credits": "1-4", "typically_offered": "", "ger": "", "requirement_sentence": "ORS (Permission Required Prior to Enrollment)"}
{"code": "MATH 495BW", "title": "Honors", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": ""}
{"code": "MATH_OX 399RE", "title": "Undergraduate Research", "credits": "1-3", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "MUS 460RW", "title": "Studies in Music History and Culture: Singing the Sacred", "credits": "4", "typically_offered": "", "ger": "History, Society, Cultures with Writing", "requirement_sentence": "Class will meet at CST 368. The purpose of this course is to provide a survey of sacred song during the past five centuries, making use of the rare items in Special Collections at Pitts Theology Library. Pitts holds one of the most extensive and diverse collections of psalmody and hymnody in the world. In some cases, a particular volume in Pitts is the only extant copy in North America, and sometimes it is the only one to be found anywhere."}
{"code": "MUS 495BW", "title": "Honors", "credits": "4", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": ""}
{"code": "MUS_OX 300RE", "title": "Oxford Chorale", "credits": "1", "typically_offered": "", "ger": "", "requirement_sentence": ""}
{"code": "MUS_OX 300VE", "title": "Oxford Chamber Ensemble", "credits": "1", "typically_offered": "Irregularly", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "MUS_OX 301RE", "title": "The Oxford Soul Collective Popular Music Ensemble", "credits": "1", "typically_offered": "Fall and Spring", "ger": "", "requirement_sentence": "(Permission of Instructor Required Prior to Enrollment)"}
{"code": "NBB 495BW", "title": "Honors Research", "credits": "1-8", "typically_offered": "Fall and Spring", "ger": "Continuing Communication and Writing(*)", "requirement_sentence": "Wednesday only"}
