{"name": "Juliette Hulgan", "rating": "5", "num_ratings": "1", "department": "Mathematics department", "reviews": [{"quality": "5.0", "course": "MATH 221", "date": "Oct 2nd, 2025", "comment": "Professor Hulgan teaches using a flipped classroom approach so experiences can vary. There is an emphasis on constructing proofs--be sure to attend lectures and complete the textbook's additional practice problems for exam preparation. If you take Dr. Hulgan's class expect clear communication and brain-teasing material!", "tags": ["GET READY TO READ", "PARTICIPATION MATTERS", "ACCESSIBLE OUTSIDE CLASS"]}], "school": "Emory Oxford", "url": "https://www.ratemyprofessors.com/professor/3102073"}
{"name": "Michael Rogers", "rating": "2.7", "num_ratings": "81", "department": "Mathematics department", "reviews": [{"quality": "1.0", "course": "MATH 221", "date": "Oct 30th, 2025", "comment": "Cant learn from his lectures, quiz is unpredictable, and the exams are extremely hard. Proofs in the exam are so hard and confusing. I have to learn the course mostly by myself from the textbook. Its hard to learn even with a decent understanding of math. Think carefully when enroll the course Math 221. He also made lots of mistakes in the lecture.", "tags": ["TOUGH GRADER", "LOTS OF HOMEWORK", "LECTURE HEAVY"]}, {"quality": "1.0", "course": "211", "date": "Oct 6th, 2025", "comment": "I don't think this guy understands what he says during lectures. About two quizs per week, even not a little relevant to what he taught. Drop the class as fast as you can", "tags": ["TOUGH GRADER", "SO MANY PAPERS"]}, {"quality": "3.0", "course": "MATH 111", "date": "May 9th, 2025", "comment": "The tests are very challenging but it is possible to do well on them. He doesn't explain concepts very well in my opinion, and he is looking for very specific answers and explanations on exams. Be prepared to study A LOT for exams to do well, and use your resources (SI sessions and math center).", "tags": ["TOUGH GRADER", "TEST HEAVY"]}, {"quality": "3.0", "course": "211", "date": "Apr 22nd, 2025", "comment": "Be prepared to teach yourself the material outside of class. Ungraded HW, weekly quizzes, 3 exams, 1 final. He's nice so he gives lots of extra points/ curves. Study in groups. Otherwise, Dr. Rogers is a really nice guy and willing to help you outside of class!", "tags": ["LECTURE HEAVY", "TEST HEAVY", "ACCESSIBLE OUTSIDE CLASS"]}, {"quality": "4.0", "course": "211", "date": "Dec 18th, 2024", "comment": "I had Dr. Rogers for two courses this semester and (DSC&211) and they were by far my hardest courses. The grades for 211 focus around tests and some quizzes which Dr. Rogers is really fair about giving partial credit. His lectures are hard to follow & grasp, so read beforehand! He's a really nice person, but expect this to be your hardest class.", "tags": ["GET READY TO READ", "CARING", "TEST HEAVY"]}], "school": "Emory Oxford", "url": "https://www.ratemyprofessors.com/professor/312654"}
{"name": "Alexander Escobar", "rating": "3.1", "num_ratings": "16", "department": "Biology department", "reviews": [{"quality": "5.0", "course": "BIOL 301", "date": "Oct 29th, 2025", "comment": "Videos have everything that you need for the tests. Quizzes are not necessarily related to content but are asked from textbook content. Lectures are clear and helpful, although not really necessary because of videos.", "tags": ["EXTRA CREDIT", "INSPIRATIONAL", "CARING"]}, {"quality": "3.0", "course": "BIOL 301", "date": "Oct 21st, 2025", "comment": "Dr. Escobar is clearly passionate and a good lecturer, lots of extra credit, fair exams. Wish we got more time during graded in-class Learning Catalytics questions.", "tags": ["EXTRA CREDIT"]}, {"quality": "5.0", "course": "BIOL 301", "date": "May 7th, 2025", "comment": "Dr. Escobar is the best for biochem!! Weekly quizzes, but he gives out a lot of extra credit!! Tests are fair, and he gives partial credit. PICK HIM for BIOCHEM", "tags": ["EXTRA CREDIT"]}, {"quality": "5.0", "course": "BIOL 301", "date": "Aug 8th, 2024", "comment": "Dr. Escobar was definitely one of the best professors I have had at Emory thus far. You can tell he genuinely cares about the wellbeing of his students as well as preparing everyone for the MCAT. I have no complaints.", "tags": ["EXTRA CREDIT", "TEST HEAVY", "ACCESSIBLE OUTSIDE CLASS"]}, {"quality": "4.0", "course": "BIOL 301", "date": "Jan 10th, 2024", "comment": "Dr. Escobar understands that most of his students are premed and he tailors his lectures a little bit to cater to that. You can do well in the class if you pay attention to his lecture and attend some of the TA review sessions. Attendance is mandatory and lectures are dry but I think most people do fairly well in the class.", "tags": ["HILARIOUS", "TEST HEAVY"]}], "school": "Emory Atlanta", "url": "https://www.ratemyprofessors.com/professor/2526076"}
{"name": "Michael McCormick", "rating": "2.7", "num_ratings": "155", "department": "Chemistry department", "reviews": [{"quality": "1.0", "course": "150L", "date": "Oct 22nd, 2025", "comment": "Painful. Meaningless. Waste of time.", "tags": []}, {"quality": "2.0", "course": "CHEM 202L", "date": "Jun 4th, 2025", "comment": "barely teaches, your lab depends on your TA. make sure to write down everything you do in lab in your notebook. post labs make no sense so go to office hours/ or work with a friend. somehow passed the final but still not exactly sure what we learned this semester. basically teaching yourself but it's chill, just make sure you have a good notebook.", "tags": ["GRADED BY FEW THINGS"]}, {"quality": "4.0", "course": "CHEM 202L", "date": "May 13th, 2025", "comment": "202L is easier than 150L and I think he enjoys it more bc he was more easygoing. Write EVERYTHING in your notebook. Post labs are easier too. Make sure u get nearly 100s in everything bc final weighs a TON. Pray u get a good TA bc they grade everything. McCormick doesn't BS but he's a fun guy - just do all the work on time and you'll be fine.", "tags": ["TOUGH GRADER", "TEST HEAVY"]}, {"quality": "3.0", "course": "CHEM 202L", "date": "May 12th, 2025", "comment": "Okay. Imma cut to the chase and tell u what u need to know. McCormick isn't your \"professor\"; your grade and lab understandings come from your TA and what you study on your own. 2nd: scavenger hunts are not that bad. the observations u need to write down are pretty self-explanatory (any physical, chemical changes, lab partner name).", "tags": ["GRADED BY FEW THINGS", "ACCESSIBLE OUTSIDE CLASS"]}, {"quality": "4.0", "course": "CHEM 202L", "date": "May 11th, 2025", "comment": "Took Chem150L and 202L with him. 150L was a big adjustment, no having done AP chem as post-labs were confusing (they still are for 202L too). However, grading criteria is pretty fair and he is actually a nice person once you remove the fact that his assessments can be difficult. Chem 150L final was harder than Chem 202L final.", "tags": []}], "school": "Emory Atlanta", "url": "https://www.ratemyprofessors.com/professor/440770"}
{"name": "Jiwon Min", "rating": "5", "num_ratings": "3", "department": "English department", "reviews": [{"quality": "5.0", "course": "English", "date": "Sep 10th, 2025", "comment": "Dr. Min is such a great professor! I took her class last semester, and she was amazing. She makes a strong effort to connect with the students, and she is incredibly passionate about the subject matter. I reccomend her courses to everyone!", "tags": ["CLEAR GRADING CRITERIA", "CARING", "ACCESSIBLE OUTSIDE CLASS"]}, {"quality": "5.0", "course": "English", "date": "Feb 20th, 2025", "comment": "I recently had Dr. Min for an English Class on Environmental Matters, and I love it! Dr. Min has a very eloquent way of speaking and she tries to connect with us students on a deeper level, especially when readings can get harder for us to understand. The books that we read are quite sensitive, but she still makes them interesting. I LOVE HER.", "tags": ["GET READY TO READ", "PARTICIPATION MATTERS", "HILARIOUS"]}], "school": "Emory Oxford", "url": "https://www.ratemyprofessors.com/professor/3076694"}
{"name": "Karida Brown", "rating": "3", "num_ratings": "4", "department": "Sociology department", "reviews": [{"quality": "1.0", "course": "SOC 247", "date": "Oct 22nd, 2025", "comment": "Very disappointed. She focused on personal stories and opinions instead of the actual course material. Discussions felt disorganized and unrelated to the topic. As someone teaching Ethics, she didn't seem to respect differing viewpoints and tended to present things only from her own perspective. I didn't feel like I learned much from this course.", "tags": []}, {"quality": "5.0", "course": "SOC 247", "date": "May 29th, 2025", "comment": "She is probably the most interesting and engaging lecturer I have had at Emory. She is truly inspirational but the class is super disorganized. Easy class--you do not need to ever show up and the assignments can still be completed because you can just pull information from the assigned readings/papers.", "tags": ["GROUP PROJECTS", "INSPIRATIONAL", "RESPECTED"]}, {"quality": "5.0", "course": "SOC 247", "date": "Mar 20th, 2025", "comment": "She's such an impressive person, and she takes time to encourage her students to find their voices. She covers a diverse amount of material that changes perspectives on race and ethnicity. During her lectures, it's evident how much knowledge she has on the topic, and she personally knows many of the scholars we read.", "tags": ["AMAZING LECTURES", "INSPIRATIONAL", "RESPECTED"]}, {"quality": "1.0", "course": "SOC 247", "date": "Oct 17th, 2024", "comment": "Mrs. Brown's class is very disordered and confusing. Her class is poorly structured and lack of knowledge. Her grade is only based on 2 papers and 1 project. But she never grade any. your success is heavily depends on the TA. Never take Karida Brown's class if you don't have to. There are tons of better race class to choose.", "tags": []}], "school": "Emory Atlanta", "url": "https://www.ratemyprofessors.com/professor/2862321"}
{"name": "Zitong Pei", "rating": "3.1", "num_ratings": "10", "department": "Mathematics department", "reviews": [{"quality": "2.0", "course": "MATH 116L", "date": "Oct 24th, 2025", "comment": "(VT) if you took calc in high school, don't bother going to test 1 lectures. after that, make sure you don't skip a single lecture. idc if you're actively dying; go to class. it'll be kind of hard to understand, but there's not really a language barrier (even though he has an accent). calc 2 is just a hard class, so work hard to do well.", "tags": ["CARING", "LECTURE HEAVY", "ACCESSIBLE OUTSIDE CLASS"]}, {"quality": "5.0", "course": "MATH 116L", "date": "May 11th, 2025", "comment": "At first I was struggling to understand and I thought it was a language barrier but Mr. Zitong clearly knows this on an extremely high level, he is Very Intelligent. this is one of the 2 lowest scoring Math classes at Tech & it is run by the department so whomever the Professor is really makes a huge difference. I wish he taught more classes too.", "tags": ["INSPIRATIONAL", "CARING", "ACCESSIBLE OUTSIDE CLASS"]}, {"quality": "5.0", "course": "MATH 111", "date": "May 10th, 2025", "comment": "the best professor, no language barrier - not understanding that comment coming from students who admitted they never went to class, so how would they know? it is a barrier for them actually wanting to learn a difficult subject and making the effort to do the work required to understand it. once u put in the effort, prof. z is the most helpful ever", "tags": []}, {"quality": "2.0", "course": "MATH 111", "date": "Jan 22nd, 2025", "comment": "Student from VT. Very apparent language barrier, lack of structure in lectures, and minimal explanations regarding foundational knowledge to fully understand and succeed in the course. Great person, very nice and willing to help, but I ended up just teaching myself w the supplementary videos provided. If you don't know calc 1, I don't recommend.", "tags": []}, {"quality": "2.0", "course": "MATH 111", "date": "Sep 26th, 2024", "comment": "Student at VT here. Zitong seems like a chill dude, but there is a crazy language barrier. Online asynchronous will be more helpful than class. He goes through a few definitions and then goes through examples without giving you a chance to try them. Like someone else said, easy grade if you know calc already; if you don't good luck.", "tags": []}], "school": "Emory Atlanta", "url": "https://www.ratemyprofessors.com/professor/2670790"}
{"name": "Christina Gavegnano", "rating": "4.6", "num_ratings": "11", "department": "Health Science department", "reviews": [{"quality": "5.0", "course": "HLTH 385", "date": "Oct 21st, 2025", "comment": "Hlth 341 Vaccines and Immunology. Her work is genuinely so inspiring & she is so cool to be able to speak with. Genuinely cares about her students doing well and is passionate about the subject. Take-home exams, minimal homework. Great lectures. She's really good at breaking down complex topics into digestible sections. TA Jules is awesome too.", "tags": ["AMAZING LECTURES", "INSPIRATIONAL"]}, {"quality": "3.0", "course": "HLTH 385", "date": "Jan 17th, 2024", "comment": "Pros: Easy A and interesting lectures Cons: Takes forever to grade and kept missing office hours I scheduled with her", "tags": []}, {"quality": "3.0", "course": "HLTH 385", "date": "Dec 11th, 2023", "comment": "She is very friendly and knowledgable when she is present, but I was overall frustrated because it was clear that teaching was not a priority for her. Over half of the classes were canceled or taught by the undergrad TA. Worth it for an easy A, but know you might not gain much from the class", "tags": []}, {"quality": "4.0", "course": "HLTH 385", "date": "Apr 29th, 2023", "comment": "I loved drug discovery with her! Her work in the field is amazing and I learned so much from her lectures. She encourages participation rather than lecturing at you. 3 take-home exams and a simple group project which are really easy, but be prepared for her to never post any grades until AFTER reading days which is ridiculous. Easy A regardless", "tags": ["AMAZING LECTURES", "INSPIRATIONAL", "RESPECTED"]}, {"quality": "5.0", "course": "HLTH 385", "date": "Mar 26th, 2023", "comment": "SHE IS THE BEST!!!!!! I took Bioethics and she has my heart. 4 shorts essays and you only do 3 of them and then one group project. !!!!!", "tags": ["CARING", "RESPECTED", "GRADED BY FEW THINGS"]}], "school": "Emory Atlanta", "url": "https://www.ratemyprofessors.com/professor/2752375"}
{"name": "Nichole Powell", "rating": "2", "num_ratings": "107", "department": "Chemistry department", "reviews": [{"quality": "1.0", "course": "CHEM 100", "date": "Oct 21st, 2025", "comment": "DO NOT TAKE HER DISCOVERY COURSE!!!!! Do not.", "tags": []}, {"quality": "3.0", "course": "CHEM 204", "date": "May 21st, 2025", "comment": "Tbh not bad for 204. Textbook readings help w/ comprehension but slides are what you need to know. Memorize the slides, refer heavily to old exams, she reuses questions. HATES slackers and whiners. Will give EC if she misgraded you or asked a bad question. Loves ppl who discuss, analyze, and care ab the class. Most people got A- or A. Overhated.", "tags": ["PARTICIPATION MATTERS", "EXTRA CREDIT"]}, {"quality": "5.0", "course": "CHEM 204", "date": "May 9th, 2025", "comment": "Great person and teacher. Lectures aren't very structured but professor Powell teaches topics through relevancy which allows for great application of course topics to real life topics. She is a wonderful and caring person and great to talk to before class starts.", "tags": ["GET READY TO READ", "INSPIRATIONAL", "TEST HEAVY"]}, {"quality": "1.0", "course": "CHEM 202", "date": "Mar 5th, 2025", "comment": "Horrible course structure for gen chem 2. Spend a lot of time outside of class looking for resources in order to succeed, aka Scharf videos and office hours.", "tags": []}, {"quality": "1.0", "course": "CHEM 202", "date": "Feb 3rd, 2025", "comment": "Worst professor ive had at Ox. She doesn't teach and her video lectures are awful. She can't even answer questions properly in class. She made me lose interest in chemistry.", "tags": ["LECTURE HEAVY", "TEST HEAVY"]}], "school": "Emory Oxford", "url": "https://www.ratemyprofessors.com/professor/1501786"}
{"name": "Sheldon Lawrence", "rating": "3.8", "num_ratings": "20", "department": "Science department", "reviews": [{"quality": "4.0", "course": "BIO 142WE", "date": "Sep 30th, 2025", "comment": "Idk why someone else said you gotta stick to the textbook. Didn't have to open the textbook once, just make sure you write down EVERYTHING he said in class down to a T. Tests are pretty fair, just take the time to study and review the content every few days. Yaps a lot in lecture. Grades easier on the papers than other 142 professors.", "tags": ["PARTICIPATION MATTERS"]}, {"quality": "5.0", "course": "BIO 142WE", "date": "Sep 10th, 2025", "comment": "He is a funny person and definitely accessible. I never got nervous of going to office hours. On the other hand, some slides might have errors/confusion. STICK ON THE TEXTBOOK. After every exam, there were lots of people asking for points back & lots of arguing back and forth, which was really amusing.", "tags": ["PARTICIPATION MATTERS", "CARING", "ACCESSIBLE OUTSIDE CLASS"]}, {"quality": "5.0", "course": "BIO 142WE", "date": "Sep 4th, 2025", "comment": "Definitely intense but especially being premed he over prepared me for exams so much I remember everything. Fav professor by far.", "tags": ["AMAZING LECTURES", "CLEAR GRADING CRITERIA", "INSPIRATIONAL"]}, {"quality": "5.0", "course": "BIO 142WE", "date": "May 20th, 2025", "comment": "My last review of Dr. Lawrence was quite harsh and I take it back. It's really amazing to have a professor who is so kind caring and accessible out of class. Never once was I scared to ask Dr. Lawrence a question, and he really wants you to succeed in the course.", "tags": ["INSPIRATIONAL", "CARING", "LECTURE HEAVY"]}, {"quality": "3.0", "course": "BIO 142WE", "date": "May 2nd, 2025", "comment": "he cares but his lecturing is kind of confusing. Very fair grader and I think he's quite good for lab. Not harsh at all and cares about your well-being", "tags": ["INSPIRATIONAL", "CARING"]}], "school": "Emory Oxford", "url": "https://www.ratemyprofessors.com/professor/2686738"}
